### Starter code for Project 3. 
#### Run these cells before starting the assignment.

#### 1. create BQ dataset:

In [5]:
%env dataset_id=school_enrollments

env: dataset_id=school_enrollments

In [6]:
!bq --location=US mk --dataset $dataset_id

BigQuery error in mk operation: Dataset 'chatgpt-436904:school_enrollments'
already exists.

#### 2. create and populate BQ tables:

In [7]:
import os

In [8]:
gsutil_cmd = "gsutil ls gs://cs327e-open-access-2/school-enrollments/*"
file_listings = os.popen(gsutil_cmd)
dataset="school_enrollments"

for file in file_listings:

    start_index = file.rindex("_") + 1
    end_index = file.rindex(".")
    table = file[start_index:end_index]
    
    if table in ("co", "district", "fl", "ga", "id", "ma", "mo", "ne", "ny", "or", "school", "sd", "wi"):
        print("skipping " + table)
        continue

    bq_cmd = "bq --location=US load --autodetect --skip_leading_rows=1 "\
             "--source_format=CSV " + dataset + "." + table + ' ' + file
    print(bq_cmd)
    
    os.system(bq_cmd)

bq --location=US load --autodetect --skip_leading_rows=1 --source_format=CSV school_enrollments.ak gs://cs327e-open-access-2/school-enrollments/zf406jp4427_ak.csv

Waiting on bqjob_r3858c529dbeba584_00000192c2830ac7_1 ... (2s) Current status: DONE

bq --location=US load --autodetect --skip_leading_rows=1 --source_format=CSV school_enrollments.ar gs://cs327e-open-access-2/school-enrollments/zf406jp4427_ar.csv

Waiting on bqjob_r7b0c6938ff6feda7_00000192c2831c8a_1 ... (4s) Current status: DONE

bq --location=US load --autodetect --skip_leading_rows=1 --source_format=CSV school_enrollments.ca gs://cs327e-open-access-2/school-enrollments/zf406jp4427_ca.csv

Waiting on bqjob_r34a06b954f74502f_00000192c2833655_1 ... (14s) Current status: DONE

skipping co
bq --location=US load --autodetect --skip_leading_rows=1 --source_format=CSV school_enrollments.ct gs://cs327e-open-access-2/school-enrollments/zf406jp4427_ct.csv

Waiting on bqjob_r111549cde53e1cbc_00000192c28378f5_1 ... (3s) Current status: DONE

skipping district
skipping fl
skipping ga
bq --location=US load --autodetect --skip_leading_rows=1 --source_format=CSV school_enrollments.hi gs://cs327e-open-access-2/school-enrollments/zf406jp4427_hi.csv

Waiting on bqjob_r5b196322b9c2e08b_00000192c2838e87_1 ... (2s) Current status: DONE

skipping id
bq --location=US load --autodetect --skip_leading_rows=1 --source_format=CSV school_enrollments.la gs://cs327e-open-access-2/school-enrollments/zf406jp4427_la.csv

Waiting on bqjob_r6e82b84054aee6f7_00000192c2839fd8_1 ... (5s) Current status: DONE

skipping ma
bq --location=US load --autodetect --skip_leading_rows=1 --source_format=CSV school_enrollments.md gs://cs327e-open-access-2/school-enrollments/zf406jp4427_md.csv

Waiting on bqjob_r47a58f58e93ba80a_00000192c283bd97_1 ... (7s) Current status: DONE

bq --location=US load --autodetect --skip_leading_rows=1 --source_format=CSV school_enrollments.mn gs://cs327e-open-access-2/school-enrollments/zf406jp4427_mn.csv

Waiting on bqjob_rfa870724dc8a8e1_00000192c283e3c6_1 ... (5s) Current status: DONE

skipping mo
bq --location=US load --autodetect --skip_leading_rows=1 --source_format=CSV school_enrollments.ms gs://cs327e-open-access-2/school-enrollments/zf406jp4427_ms.csv

Waiting on bqjob_r1c6843ce6440a8f9_00000192c28401df_1 ... (2s) Current status: DONE

skipping ne
bq --location=US load --autodetect --skip_leading_rows=1 --source_format=CSV school_enrollments.nh gs://cs327e-open-access-2/school-enrollments/zf406jp4427_nh.csv

Waiting on bqjob_r7332afd323e13561_00000192c28412f5_1 ... (2s) Current status: DONE

bq --location=US load --autodetect --skip_leading_rows=1 --source_format=CSV school_enrollments.nv gs://cs327e-open-access-2/school-enrollments/zf406jp4427_nv.csv

Waiting on bqjob_r4b69e957cfe5ad8_00000192c2842440_1 ... (2s) Current status: DONE

skipping ny
bq --location=US load --autodetect --skip_leading_rows=1 --source_format=CSV school_enrollments.ok gs://cs327e-open-access-2/school-enrollments/zf406jp4427_ok.csv

Waiting on bqjob_r158f03e0602aacd2_00000192c284356e_1 ... (4s) Current status: DONE

skipping or
bq --location=US load --autodetect --skip_leading_rows=1 --source_format=CSV school_enrollments.pa gs://cs327e-open-access-2/school-enrollments/zf406jp4427_pa.csv

Waiting on bqjob_r5e860e4a120dd9c2_00000192c2844f1e_1 ... (4s) Current status: DONE

bq --location=US load --autodetect --skip_leading_rows=1 --source_format=CSV school_enrollments.sc gs://cs327e-open-access-2/school-enrollments/zf406jp4427_sc.csv

Waiting on bqjob_rd75b9a8912c40d3_00000192c28468d0_1 ... (2s) Current status: DONE

skipping school
skipping sd
bq --location=US load --autodetect --skip_leading_rows=1 --source_format=CSV school_enrollments.tx gs://cs327e-open-access-2/school-enrollments/zf406jp4427_tx.csv

Waiting on bqjob_r491d562269dfa79d_00000192c28479d7_1 ... (4s) Current status: DONE

bq --location=US load --autodetect --skip_leading_rows=1 --source_format=CSV school_enrollments.wa gs://cs327e-open-access-2/school-enrollments/zf406jp4427_wa.csv

Waiting on bqjob_r2a6d974b08d19982_00000192c2849370_1 ... (4s) Current status: DONE

skipping wi
bq --location=US load --autodetect --skip_leading_rows=1 --source_format=CSV school_enrollments.wy gs://cs327e-open-access-2/school-enrollments/zf406jp4427_wy.csv

Waiting on bqjob_r5eae208ddd5a8b10_00000192c284ad60_1 ... (2s) Current status: DONE

#### 3. Find school enrollments by school name, grade level, and year for Texas

In [9]:
!bq show --schema=true $dataset_id.tx

[{"name":"state","type":"STRING","mode":"NULLABLE"},{"name":"county","type":"STRING","mode":"NULLABLE"},{"name":"county_state_id","type":"STRING","mode":"NULLABLE"},{"name":"admin_level","type":"STRING","mode":"NULLABLE"},{"name":"district_nces_id","type":"INTEGER","mode":"NULLABLE"},{"name":"district_state_id","type":"INTEGER","mode":"NULLABLE"},{"name":"district_state_type","type":"STRING","mode":"NULLABLE"},{"name":"district","type":"STRING","mode":"NULLABLE"},{"name":"ccd_district_type","type":"STRING","mode":"NULLABLE"},{"name":"ccd_charter","type":"STRING","mode":"NULLABLE"},{"name":"ccd_district_lvl","type":"STRING","mode":"NULLABLE"},{"name":"ccd_district_low_grade","type":"STRING","mode":"NULLABLE"},{"name":"ccd_district_high_grade","type":"STRING","mode":"NULLABLE"},{"name":"school_nces_id","type":"INTEGER","mode":"NULLABLE"},{"name":"school_state_id","type":"FLOAT","mode":"NULLABLE"},{"name":"school","type":"STRING","mode":"NULLABLE"},{"name":"school_state_type","type":"STRING","mode":"NULLABLE"},{"name":"ccd_school_type","type":"STRING","mode":"NULLABLE"},{"name":"ccd_charter_school","type":"BOOLEAN","mode":"NULLABLE"},{"name":"ccd_school_lvl","type":"STRING","mode":"NULLABLE"},{"name":"ccd_school_low_grade","type":"STRING","mode":"NULLABLE"},{"name":"ccd_school_high_grade","type":"STRING","mode":"NULLABLE"},{"name":"year","type":"INTEGER","mode":"NULLABLE"},{"name":"term","type":"STRING","mode":"NULLABLE"},{"name":"grade","type":"STRING","mode":"NULLABLE"},{"name":"white","type":"STRING","mode":"NULLABLE"},{"name":"black","type":"STRING","mode":"NULLABLE"},{"name":"hispanic","type":"STRING","mode":"NULLABLE"},{"name":"native_american","type":"STRING","mode":"NULLABLE"},{"name":"native_american_alaskan_native","type":"STRING","mode":"NULLABLE"},{"name":"asian","type":"STRING","mode":"NULLABLE"},{"name":"native_hawaiian","type":"STRING","mode":"NULLABLE"},{"name":"asian_pacific_islander","type":"STRING","mode":"NULLABLE"},{"name":"native_hawaiian_pacific_islander","type":"STRING","mode":"NULLABLE"},{"name":"pacific_islander","type":"STRING","mode":"NULLABLE"},{"name":"multiracial","type":"STRING","mode":"NULLABLE"},{"name":"unknown_race","type":"STRING","mode":"NULLABLE"},{"name":"male","type":"STRING","mode":"NULLABLE"},{"name":"female","type":"STRING","mode":"NULLABLE"},{"name":"non_binary","type":"STRING","mode":"NULLABLE"},{"name":"unknown_gender","type":"STRING","mode":"NULLABLE"},{"name":"ell","type":"STRING","mode":"NULLABLE"},{"name":"ell_percent","type":"STRING","mode":"NULLABLE"},{"name":"homeless","type":"STRING","mode":"NULLABLE"},{"name":"homeless_percent","type":"STRING","mode":"NULLABLE"},{"name":"low_income","type":"STRING","mode":"NULLABLE"},{"name":"free_and_reduced","type":"STRING","mode":"NULLABLE"},{"name":"free_and_reduced_percent","type":"STRING","mode":"NULLABLE"},{"name":"disability","type":"STRING","mode":"NULLABLE"},{"name":"section_504","type":"STRING","mode":"NULLABLE"},{"name":"total","type":"STRING","mode":"NULLABLE"}]

#### Note: STRING type for "total" column

In [9]:
%%bigquery
select school, grade, year, sum(cast(replace(replace(total, ",", ""), "<", "") as int64)) as total
from school_enrollments.tx
where total != "" and school != "" and district like '%AUSTIN%'
group by school, grade, year
order by school, grade, year

Query complete after 0.00s: 100%|██████████| 3/3 [00:00<00:00, 1818.60query/s]
Downloading: 100%|██████████| 1739/1739 [00:01<00:00, 1684.76rows/s]

         school             grade  year  total
0     AKINS H S          grade_10  2020    720
1     AKINS H S          grade_10  2021    747
2     AKINS H S          grade_11  2020    664
3     AKINS H S          grade_11  2021    663
4     AKINS H S          grade_12  2020    609
...         ...               ...   ...    ...
1734  ZILKER EL           grade_5  2021     69
1735  ZILKER EL      kindergarten  2020     77
1736  ZILKER EL      kindergarten  2021     63
1737  ZILKER EL  pre_kindergarten  2020     30
1738  ZILKER EL  pre_kindergarten  2021     13

[1739 rows x 4 columns]

##### Documentation on BQ's string functions: https://cloud.google.com/bigquery/docs/reference/standard-sql/string_functions

In [24]:
!bq --location=US mk --dataset "views"

Dataset 'chatgpt-436904:views' successfully created.

In [11]:
%%bigquery
create view views.austin_enrollments_by_school_grade_year as
select school, grade, year, sum(cast(replace(replace(total, ",", ""), "<", "") as int64)) as total
from school_enrollments.tx
where total != "" and school != "" and district like '%AUSTIN%'
group by school, grade, year
order by school, grade, year

Query complete after 0.00s: 100%|██████████| 1/1 [00:00<00:00, 1170.94query/s]

Empty DataFrame
Columns: []
Index: []

In [12]:
%%bigquery
select * from views.austin_enrollments_by_school_grade_year

Query complete after 0.00s: 100%|██████████| 3/3 [00:00<00:00, 1802.45query/s]
Downloading: 100%|██████████| 1739/1739 [00:00<00:00, 1805.85rows/s]

         school             grade  year  total
0     AKINS H S          grade_10  2020    720
1     AKINS H S          grade_10  2021    747
2     AKINS H S          grade_11  2020    664
3     AKINS H S          grade_11  2021    663
4     AKINS H S          grade_12  2020    609
...         ...               ...   ...    ...
1734  ZILKER EL           grade_5  2021     69
1735  ZILKER EL      kindergarten  2020     77
1736  ZILKER EL      kindergarten  2021     63
1737  ZILKER EL  pre_kindergarten  2020     30
1738  ZILKER EL  pre_kindergarten  2021     13

[1739 rows x 4 columns]

#### 4. Open Data Studio and create a chart from this view:
##### https://datastudio.google.com/

#### Project 3 homework marker. Start homework from here.

In [12]:
%%bigquery
#Get the total number of enrollments in Texas ordered by district in 2021
select district, count(*) AS total_enrollments
from school_enrollments.tx
where year = 2021
group by district
having total_enrollments > 1000
order by total_enrollments desc;

Query is running:   0%|          |

Downloading:   0%|          |

         district  total_enrollments
0     HOUSTON ISD               1960
1      DALLAS ISD               1668
2  FORT WORTH ISD               1012

In [14]:
%%bigquery
#Get the grade level enrollment average in Texas in 2020
select grade, avg(cast(replace(replace(total, ',', ''), '<', '') as int64)) as avg_enrollment
from school_enrollments.tx
where year = 2020 and total != ""
group by grade
order by avg_enrollment desc;

Query is running:   0%|          |

Downloading:   0%|          |

               grade  avg_enrollment
0            grade_9      271.162602
1           grade_10      247.053539
2            grade_7      239.575783
3           grade_11      232.763603
4            grade_8      230.208822
5           grade_12      225.357731
6            grade_6      223.251977
7            grade_5      150.770908
8            grade_4      138.950087
9            grade_3      135.757780
10           grade_1      135.360186
11      kindergarten      134.763996
12           grade_2      134.534623
13  pre_kindergarten      109.578913
14   early_education       18.575294

In [22]:
%%bigquery
#Get the number of schools for each district with total enrollments exceeding 500 in Texas for the year 2021
select district, count(distinct school) as school_count
from school_enrollments.tx
where year = 2021 and total != ""
group by district
having sum(cast(replace(replace(total, ',', ''), '<', '') as int64)) > 500
order by school_count desc;

Query is running:   0%|          |

Downloading:   0%|          |

                               district  school_count
0                           HOUSTON ISD           274
1                            DALLAS ISD           233
2                        FORT WORTH ISD           143
3                            AUSTIN ISD           124
4                         NORTHSIDE ISD           121
..                                  ...           ...
986    ST MARY'S ACADEMY CHARTER SCHOOL             2
987   STEPHEN F AUSTIN STATE UNIVERSITY             2
988            TEXAS SCHOOL OF THE ARTS             2
989                 THE GATHERING PLACE             2
990  UNIVERSITY OF TEXAS ELEMENTARY CHA             2

[991 rows x 2 columns]

In [17]:
%%bigquery
#Get the total number of enrollments for each district in Texas for 2020 and with only districts with enrollments over 1000
select district, sum(cast(replace(replace(total, ',', ''), '<', '') as int64)) as total_enrollments
from school_enrollments.tx
where year = 2020 and total != ""
group by district
having total_enrollments > 1000
order by total_enrollments desc;

Query is running:   0%|          |

Downloading:   0%|          |

                         district  total_enrollments
0                     HOUSTON ISD             421837
1                      DALLAS ISD             308375
2           CYPRESS-FAIRBANKS ISD             235154
3                   NORTHSIDE ISD             216555
4                        KATY ISD             166978
..                            ...                ...
805                  LOVELADY ISD               1014
806                SCHLEICHER ISD               1010
807                     SANTO ISD               1008
808                   WORTHAM ISD               1006
809  CEDARS INTERNATIONAL ACADEMY               1002

[810 rows x 2 columns]

In [18]:
%%bigquery
#Get total enrollment in Texas for grades kindergarten through grade 2 for 2021
select grade, sum(cast(replace(replace(total, ',', ''), '<', '') as int64)) as total
from school_enrollments.tx
where year = 2021 and grade in ('kindergarten', 'grade_1', 'grade_2')
group by grade
order by grade;

Query is running:   0%|          |

Downloading:   0%|          |

          grade   total
0       grade_1  764379
1       grade_2  761878
2  kindergarten  724849

In [19]:
%%bigquery
#Get total enrollment in Texas for grades 3 through 5 for 2020 and combine with grades 6 through 8 for the same year
select grade, sum(cast(replace(replace(total, ',', ''), '<', '') as int64)) as total
from school_enrollments.tx
where year = 2020 and grade in ('grade_3', 'grade_4', 'grade_5')
group by grade
union all
select grade, sum(cast(replace(replace(total, ',', ''), '<', '') as int64)) as total
from school_enrollments.tx
where year = 2020 and grade in ('grade_6', 'grade_7', 'grade_8')
group by grade
order by grade;

Query is running:   0%|          |

Downloading:   0%|          |

     grade   total
0  grade_3  785223
1  grade_4  801742
2  grade_5  836477
3  grade_6  847018
4  grade_7  848817
5  grade_8  824608

In [20]:
%%bigquery
#Get total enrollment across all districts in Texas for the year 2021, only including non-empty total fields
select district, sum(cast(replace(replace(total, ',', ''), '<', '') as int64)) as total_enrollment
from school_enrollments.tx
where year = 2021 and total != ""
group by district
having total_enrollment > 2000
order by total_enrollment desc;

Query is running:   0%|          |

Downloading:   0%|          |

                     district  total_enrollment
0                 HOUSTON ISD            395044
1                  DALLAS ISD            290861
2       CYPRESS-FAIRBANKS ISD            230053
3               NORTHSIDE ISD            207260
4                    KATY ISD            168546
..                        ...               ...
566         NIXON-SMILEY CISD              2047
567                BLANCO ISD              2040
568  LA ACADEMIA DE ESTRELLAS              2034
569             CHILDRESS ISD              2020
570              S AND S CISD              2002

[571 rows x 2 columns]

In [21]:
%%bigquery
#Get total enrollment by district for 2020, limiting to districts with over 1000 enrollments and including only certain districts
select district, sum(cast(replace(replace(total, ',', ''), '<', '') as int64)) as total_enrollment
from school_enrollments.tx
where year = 2020 and total != "" and district in ('HOUSTON ISD', 'DALLAS ISD')
group by district
having total_enrollment > 1000
order by total_enrollment desc;

Query is running:   0%|          |

Downloading:   0%|          |

      district  total_enrollment
0  HOUSTON ISD            421837
1   DALLAS ISD            308375

In [25]:
%%bigquery
#Create a view for total enrollments by grade in Texas for the year 2021
create view views.total_enrollments_by_grade_2021 as
select grade, sum(cast(replace(replace(total, ',', ''), '<', '') as int64)) as total_enrollment
from school_enrollments.tx
where year = 2021 and total != ""
group by grade
order by total_enrollment desc;

Query is running:   0%|          |

Empty DataFrame
Columns: []
Index: []

In [26]:
%%bigquery
#Create a view for the number of schools in each district with total enrollments exceeding 500 in Texas for the year 2021
create view views.schools_above_500_enrollments_2021 as
select district, count(distinct school) as school_count
from school_enrollments.tx
where year = 2021 and total != ""
group by district
having sum(cast(replace(replace(total, ',', ''), '<', '') as int64)) > 500
order by school_count desc;

Query is running:   0%|          |

Empty DataFrame
Columns: []
Index: []